from random import *
from time import *

# 이 알고리즘이 별로 마음에 들진 않지만 완성은 해본다
# 알고리즘 변경을 해보겠다 (못해먹겠음) (대대적이진 않지만..)
subjectList4 = ["국어","영어","과학","수학"]
subjectList3 = ["가정","체육"]
subjectList2 = ["사회","역사"]
subjectList1 = ["진로","스포츠","한문","음악","미술"]

# 스케줄
schedules =[[["","","","","",""],
             ["","","","","",""],
             ["","","","","",""],
             ["","","","","",""],#곱하면 버그생김
             ["","","","","",""]]]
classNum = int(input("반 개수:"))
for i in range(classNum-1):
    schedules.append([["","","","","",""],
                      ["","","","","",""],
                      ["","","","","",""],
                      ["","","","","",""],
                      ["","","","","",""]])



print(schedules)